# a = '12.0'
# float(a)
#
# is_nice =False
# state = "nice" if is_nice else "not_nice"
# print(state)



# ------------------- Циклы ----------------------- #
# - повторение действий
# while,  for

#----------------while -----------------------#
# while условие:
#   инструкции

# n = 10 # кол-во грязных тарелок
# while n != 0:
#     print("Берем грязную тарелку")
#     print("Моем грязную тарелку")
#     n -= 1 # n = n - 1
#     print(f"осталось грязных тарелок = {n}")
#     print("Ставим чистую тарелку сушиться", end = '\n ------------------------------- \n')

# # ------------------------ЗАДАЧА------------------------------#
# # Квадрат при помощи черепахи
#
# from turtle import *
# side = 0 # ни одна сторона еще не нарисована
# shape('turtle')
# while side < 4:# Черепаха должна остановиться когда нарисует 4 стороны
#     forward(100)
#     left(90)
#     stamp()# создает копию фигуры и  оставляет на окне
#     side += 1 #нарисовала и потом посчитала
#     print(f'Нарисовала {side} сторон')
#     import time
#     time.sleep(1)



# ------------------------ЗАДАЧА------------------------------#
# file spider.gif (черепха должна нарисовать снежинку)

from time import *
from turtle import *
side = 0
while side != 12:
    forward(100)
    stamp()
    backward(100)
    left(360//12) # 30
    side += 1
    sleep(1)
    print(f'Нарисовала {side} сторон')

